### 5.4.2 누락된 값 채우기

- 누락된 값을 제외시키지 않고(잠재적으로 다른 데이터도 함께 버려질 가능성이 있다) 데이터상의 '구멍'을 어떻게든 메우고 싶은 경우 ffillna 메서드 활용

In [1]:
from pandas import Series, DataFrame
import numpy as np
import pandas as pd

In [2]:
df = DataFrame(np.random.randn(7, 3))

In [3]:
df.fillna(0)

          0         1         2
0 -0.318109 -0.738450 -1.607689
1 -1.008135  2.418585 -0.469443
2  0.064360  0.665083  0.618629
3  0.809208 -1.450091  0.256098
4 -0.148780 -4.335255  0.322858
5  1.089585  0.438353 -0.343208
6  1.020280  0.288682  0.922238

In [4]:
# dictionary 형식으로 받았는데 앞의 key가 컬럼을 나타냄
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.318109 -0.738450 -1.607689
1 -1.008135  2.418585 -0.469443
2  0.064360  0.665083  0.618629
3  0.809208 -1.450091  0.256098
4 -0.148780 -4.335255  0.322858
5  1.089585  0.438353 -0.343208
6  1.020280  0.288682  0.922238

In [5]:
df.fillna({2:0.5, 1:-1})

          0         1         2
0 -0.318109 -0.738450 -1.607689
1 -1.008135  2.418585 -0.469443
2  0.064360  0.665083  0.618629
3  0.809208 -1.450091  0.256098
4 -0.148780 -4.335255  0.322858
5  1.089585  0.438353 -0.343208
6  1.020280  0.288682  0.922238

In [6]:
df.fillna?

inplace : boolean, default False
    If True, fill the DataFrame in place. Note: this will modify any
    other views on this DataFrame, like if you took a no-copy slice of
    an existing DataFrame, for example a column in a DataFrame. Returns
    a reference to the filled object, which is self if inplace=True

In [7]:
# fillna는 값을 채워 넣은 객체의 참조를 반환한다.
_ = df.fillna(0, inplace=True)

In [8]:
df

          0         1         2
0 -0.318109 -0.738450 -1.607689
1 -1.008135  2.418585 -0.469443
2  0.064360  0.665083  0.618629
3  0.809208 -1.450091  0.256098
4 -0.148780 -4.335255  0.322858
5  1.089585  0.438353 -0.343208
6  1.020280  0.288682  0.922238

In [9]:
_ = df.fillna(1, inplace=False)

In [10]:
df

          0         1         2
0 -0.318109 -0.738450 -1.607689
1 -1.008135  2.418585 -0.469443
2  0.064360  0.665083  0.618629
3  0.809208 -1.450091  0.256098
4 -0.148780 -4.335255  0.322858
5  1.089585  0.438353 -0.343208
6  1.020280  0.288682  0.922238

In [11]:
df.fillna(1, inplace=True)

In [12]:
# 이미 NA값이 0.0 으로 채워져있기 때문에 1로 바뀌지 않는다.
df

          0         1         2
0 -0.318109 -0.738450 -1.607689
1 -1.008135  2.418585 -0.469443
2  0.064360  0.665083  0.618629
3  0.809208 -1.450091  0.256098
4 -0.148780 -4.335255  0.322858
5  1.089585  0.438353 -0.343208
6  1.020280  0.288682  0.922238

In [13]:
df = DataFrame(np.random.randn(6, 3))

In [15]:
from numpy import nan as NA
df.ix[2:, 1] = NA
df.ix[4:, 2] = NA

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  from ipykernel import kernelapp as app

In [16]:
df

          0         1         2
0  1.065597  0.514265 -0.634737
1  1.106952 -0.056334 -0.535182
2 -0.147386       NaN -1.466286
3  1.545524       NaN -0.391299
4 -0.492169       NaN       NaN
5  1.705640       NaN       NaN

In [17]:
df.fillna(method='ffill')

          0         1         2
0  1.065597  0.514265 -0.634737
1  1.106952 -0.056334 -0.535182
2 -0.147386 -0.056334 -1.466286
3  1.545524 -0.056334 -0.391299
4 -0.492169 -0.056334 -0.391299
5  1.705640 -0.056334 -0.391299

In [18]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.065597  0.514265 -0.634737
1  1.106952 -0.056334 -0.535182
2 -0.147386 -0.056334 -1.466286
3  1.545524 -0.056334 -0.391299
4 -0.492169       NaN -0.391299
5  1.705640       NaN -0.391299

In [19]:
data = Series([1., NA, 3.5, NA, 7])

- fillna에 평균값이나 중간값을 전달해서 데이터의 높낮이를 줄일 수 있다.

In [20]:
# Series의 평균 값이나 중간 값으로 전달한다.
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [21]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

#### fillna 함수 인자

인자 | 설명
--- | ---
value | 비어있는 값을 채울 스칼라 값이나 사전 형식의 객체
method | 보간 방식. 기본적으로 'ffill'을 사용한다.
axis | 값을 채워 넣을 축. 기본 값은 0
inace | 복사본을 생성하지 않고 호출한 객체를 변경한다. 기본값은 False
limit | 값을 앞 혹은 뒤에서 몇 개까지 채울지를 지정한다.

## 5.5 계층적 색인

- **계층적 색인**은 pandas의 중요한 기능
- 축에 대해 다중(둘 이상) 색인 단계를 지정할 수 있도록 해준다.
- 약간 추상적으로 말하면 차원이 높은(고차원) 데이터를 낮은 차원의 형식으로 다룰 수 있게 해주는 기능

In [22]:
# MultiIndex를 색인하는 Series로 색인의 계층을 보여주고 있다.
data = Series(np.random.randn(10),
              index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                       [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [23]:
data

a  1    0.160341
   2    0.776948
   3    0.857916
b  1    0.916508
   2   -2.013940
   3   -0.136653
c  1    0.201637
   2    0.712048
d  2   -0.852846
   3   -0.749780
dtype: float64

In [24]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [25]:
# 계층적으로 색인된 객체는 데이터의 부분집합을 부분적 색인으로 접근하는 것이 가능하다.
data['b']

1    0.916508
2   -2.013940
3   -0.136653
dtype: float64

In [26]:
data['b':'c']

b  1    0.916508
   2   -2.013940
   3   -0.136653
c  1    0.201637
   2    0.712048
dtype: float64

In [27]:
data.ix[['b', 'd']]

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  if __name__ == '__main__':

b  1    0.916508
   2   -2.013940
   3   -0.136653
d  2   -0.852846
   3   -0.749780
dtype: float64

In [28]:
data['b':'d']

b  1    0.916508
   2   -2.013940
   3   -0.136653
c  1    0.201637
   2    0.712048
d  2   -0.852846
   3   -0.749780
dtype: float64

In [29]:
# 하위 계층의 객체를 선택하는 것도 가능하다.
data[:, 2]

a    0.776948
b   -2.013940
c    0.712048
d   -0.852846
dtype: float64

In [30]:
data['c', 2]

0.71204788650668849

In [31]:
data

a  1    0.160341
   2    0.776948
   3    0.857916
b  1    0.916508
   2   -2.013940
   3   -0.136653
c  1    0.201637
   2    0.712048
d  2   -0.852846
   3   -0.749780
dtype: float64

- 계층적 색인은 데이터를 재형성하고 피벗 테이블 생성같은 그룹 기반의 작업을 할 때 중요하게 사용
- unstack 메서드를 사용해서 데이터를 새롭게 배열 가능

#### stack은 쌓는다. unstack은 당연히 쌓여져 있는 것을 푼다 라는 의미로 생각됨

In [32]:
data.unstack()

          1         2         3
a  0.160341  0.776948  0.857916
b  0.916508 -2.013940 -0.136653
c  0.201637  0.712048       NaN
d       NaN -0.852846 -0.749780

In [33]:
# unstack의 반대 작업은 stack이다.
data.unstack().stack()

a  1    0.160341
   2    0.776948
   3    0.857916
b  1    0.916508
   2   -2.013940
   3   -0.136653
c  1    0.201637
   2    0.712048
d  2   -0.852846
   3   -0.749780
dtype: float64

In [34]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])

In [35]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [36]:
# 계층적 색인의 각 단계는 이름을 가질 수 있다.
# 만약 이름이 있다면 콘솔 출력 시에 함께 나타낸다.
frame.index.names = ['key1', 'key2']

In [37]:
frame.columns.names = ['state', 'color']

In [38]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [39]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

#### MultiIndex는 따로 생성한 다음에 재사용

In [40]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### 5.5.1 계층 순서 바꾸고 정렬하기

#### swallevel은 넘겨받은 2개의 계층 번호나 이름이 뒤바뀐 새로운 객체를 반환(하지만 데이터는 변경되지 않는다)

In [41]:
# swaplevel은 넘겨받은 2개의 계층 번호나 이름이 뒤바뀐 새로운 객체를 반환한다.
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [42]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

#### swaplevel

- 0, 1인 index로도 swap 할 수 있고
- 이름으로도 swap 할 수 있다.

#### sortlevel

- 0: key1
- 1: kye2
- 이름으로도 할 수 있다.
- 를 정렬 기준으로 한다는 것

In [43]:
# sortlevel메서드는 단일 계층에 속한 데이터를 정렬해준다.
frame.sortlevel?

In [44]:
frame.sortlevel(1)

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  if __name__ == '__main__':

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [45]:
frame.sortlevel('key2')

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  if __name__ == '__main__':

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [46]:
frame.sortlevel(0)

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  if __name__ == '__main__':

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [47]:
frame.sortlevel('key1')

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  if __name__ == '__main__':

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [48]:
# swaplevel을 사용해서 계층을 바꿀 때 대개는 sortlevel을 사용해서 결과도 사전식으로 정렬한다.
frame.swaplevel(0, 1).sortlevel(0)

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:2: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  from ipykernel import kernelapp as app

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [49]:
frame.swaplevel(0, 1).sortlevel(1)

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  if __name__ == '__main__':

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [50]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [51]:
frame.swaplevel(1, 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [52]:
frame.swaplevel('key2', 'key1')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [53]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [54]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### 5.5.2 단계별 요약통계

- 기술통계와 요약통계는 level 옵션을 가지고 있다.
- 어떠한 축에 대해 합을 구하고 싶은 단계 지정

In [55]:
# level옵션은 많은 기술통계와 요약통계를 나타내 준다.
# 어떤 한 축에 대해 합을 구하고 싶은 단계를 지정할 수 있는 옵션이다.
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [56]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [57]:
#  soqnwjrdmfh  pandas의 groupby 기능 이용해서 구현
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [58]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### 5.5.3 DataFrame의 칼럼 사용하기

In [59]:
frame = DataFrame({'a': range(7),
                   'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})

In [60]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [61]:
# set_index함수는 하나 이상의 칼럼을 색인으로 하는 새로은 DataFrame을 생성한다.
frame2 = frame.set_index(['c', 'd'])

In [62]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [63]:
# 다음코드처럼 칼럼을 명시적으로 남겨두지 않으면 DataFrame에서 삭제된다.
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [64]:
# 계층적 색인 단계가 칼럼으로 이동한다.
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [65]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

## 5.6 pandas와 관련된 기타 주제

### 5.6.1 정수 색인

- 여기 ser 객체는 0, 1, 2 색인을 가지고 있지만 사용자가 원하는 것이 위치 색인인지? 이름 색인인지 알아맞히는 것은 어려운 일
- 일관성을 유지하기 위해 색인 값을 가진 축 색인이 있을 경우 정수 데이터는 항상 이름을 지향

In [66]:
ser = Series(np.arange(3.))

In [67]:
# 왼쪽에 있는 것이 이름 색인(0, 1, 2)
# 위치색인은 0, 1, 2 번째 순서대로 있는 것
# 현재는 위치 색인과, 이름 색인이 같기 때문에 프로그램에게는 혼동이 올 수 밖에 없다.
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [68]:
ser[0]

0.0

In [69]:
ser[2]

2.0

In [70]:
# -1이 0,1,2,...,-2,-1 의 정수
# pandas객체를 정수로 색인해서 사용하는 일은 파이썬에서 리스트나 튜플같은 
# 기본 자료구조에서 사용되는 색인의 의미와 약간 다르다.
# 사용자가 원하는 것이 위치 색인인지 이름 색인인지 모른다.
ser[-1]

KeyError: -1

In [71]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

- 정수 색인이 아닐때

In [72]:
ser5 = Series([0, 0, 1], index=[5, 6, 7])

In [73]:
ser5

5    0
6    0
7    1
dtype: int64

In [74]:
# 이걸 보면 이름 색인으로 접근하는 것을 알 수 있다.
ser5[6]

0

In [75]:
# 이름 색인이 정수라면 위치 색인을 사용할 수 없다.
ser5[-1]

KeyError: -1

In [76]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [77]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [78]:
ser2[0]

0.0

In [79]:
ser2[1]

1.0

In [80]:
ser2[-1]

2.0

In [81]:
# ix는 끝 인덱스인 1까지 포함한다.
ser.ix[:1]

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  from ipykernel import kernelapp as app

0    0.0
1    1.0
dtype: float64

#### 만일 색인의 종류에 상관없이 위치 기반의 색인이 필요하다면 Series의 iget_value 메서드와 DataFrame의 irow, icol 메서드를 사용하면 된다

In [82]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [83]:
ser3

-5    0
 1    1
 3    2
dtype: int64

In [84]:
# 0,1의 1번째에 있는 값을 보여준다.
ser3.iat[1]

1

In [85]:
ser3.iat[2]

2

In [86]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])

In [87]:
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int64

In [88]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [89]:
frame.iloc[1]

0    2
1    3
Name: 0, dtype: int64

### 5.6.2 Panel 데이터

- Panel은 DataFrame의 3차원 버전
- pandas 개발은 스프레드시트 형식의 데이터를 다루는 데 초점
- 계층적 색인을 이용하면 대개의 경우 N차원의 배열은 불필요

In [96]:
from pandas_datareader import data as web

all_data = {}

# GOOG -> GOOGL
for ticker in ['AAPL', 'GOOGL', 'MSFT', 'IBM']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

In [97]:
# GOOG -> GOOGL
import pandas_datareader.data as web
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012'))
                      for stk in ['AAPL', 'GOOGL', 'MSFT', 'IBM']))

In [98]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 861 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Volume

In [99]:
# swapaxes메서드는 첫번째인자인 1번 축과 두번째 인자인 2번 축을 교환해주는 메서드이다.
pdata = pdata.swapaxes('items', 'minor')

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:2: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  from ipykernel import kernelapp as app

In [100]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 861 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [101]:
pdata['Adj Close']

                 AAPL       GOOGL         IBM       MSFT
Date
2009-01-02  11.663397  160.820816   70.606422  16.221966
2009-01-05  12.155637  164.189194   70.161949  16.373566
2009-01-06  11.955145  167.197205   72.109543  16.565073
2009-01-07  11.696815  161.166168   70.945831  15.567659
2009-01-08  11.914015  162.757751   70.452896  16.054396
2009-01-09  11.641547  157.692688   68.448715  15.575633
2009-01-12  11.394788  156.501495   69.264938  15.535741
2009-01-13  11.272690  157.317322   68.965927  15.815017
2009-01-14  10.966806  150.635635   67.228455  15.232523
2009-01-15  10.716188  149.644638   67.980003  15.352218
2009-01-16  10.581241  149.984985   68.626495  15.727242
2009-01-20  10.050444  141.516510   66.250587  14.745786
2009-01-21  10.645502  151.691696   73.879372  15.463924
2009-01-22  11.356230  153.403397   72.788361  13.652620
2009-01-23  11.356230  162.512512   72.319672  13.724436
2009-01-26  11.520738  162.097092   74.024818  14.067541
2009-01-27  11.660825  165.905899   74.073318  14.091482
2009-01-28  12.106798  174.509506   76.627014  14.394695
2009-01-29  11.952574  171.831833   74.760216  14.035626
2009-01-30  11.583714  169.434433   74.065216  13.644643
2009-02-02  11.761074  170.455460   73.483383  14.227131
2009-02-03  11.950002  170.395401   75.544106  14.761744
2009-02-04  12.023260  171.671677   75.018852  14.865476
2009-02-05  12.397261  177.037033   74.679413  15.192631
2009-02-06  12.816242  185.825821   78.116402  15.687345
2009-02-09  13.174819  189.574570   78.668938  15.511801
2009-02-10  12.573337  179.434433   75.784439  15.001121
2009-02-11  12.443527  179.199203   77.320145  15.328272
2009-02-12  12.758407  181.706711   77.247017  15.368173
2009-02-13  12.744272  179.019012   76.247589  15.232523
...               ...         ...         ...        ...
2012-04-20  73.640701  298.328339  171.170486  27.927738
2012-04-23  73.476189  299.099091  170.330078  27.669308
2012-04-24  72.008469  300.935944  171.513489  27.497025
2012-04-25  78.398598  305.165161  174.575073  27.738220
2012-04-26  78.102997  308.043030  176.298721  27.660694
2012-04-27  77.498940  307.797791  177.353577  27.548706
2012-04-30  75.054443  302.727722  177.585083  27.583172
2012-05-01  74.816681  302.517517  178.374084  27.574554
2012-05-02  75.311485  303.933929  178.425461  27.393648
2012-05-03  74.776848  305.815826  177.722336  27.359194
2012-05-04  72.647217  298.783783  175.792801  26.687277
2012-05-07  73.190880  304.079071  174.729385  26.402998
2012-05-08  73.023804  306.701691  173.506546  26.273787
2012-05-09  73.152298  304.879883  173.291260  26.497759
2012-05-10  73.324539  307.137146  172.748734  26.480532
2012-05-11  72.834885  302.917908  173.239578  26.842335
2012-05-14  71.743683  302.302307  171.749802  26.428841
2012-05-15  71.094658  305.860870  171.405273  26.194729
2012-05-16  70.183449  314.779785  171.999512  25.925936
2012-05-17  68.132248  311.836823  170.414993  25.769852
2012-05-18  68.165665  300.500488  168.684082  25.379671
2012-05-21  72.136993  307.362366  170.302994  25.795868
2012-05-22  71.583061  300.700714  169.493561  25.804539
2012-05-23  73.329674  305.035034  168.890732  25.240936
2012-05-24  72.656212  302.132141  168.864868  25.206251
2012-05-25  72.266800  296.061066  167.323425  25.197577
2012-05-29  73.549454  297.467468  169.183533  25.631123
2012-05-30  74.436249  294.409424  167.521484  25.440367
2012-05-31  74.251175  290.720734  166.117752  25.310303
2012-06-01  72.099739  285.775787  162.828171  24.668653

[861 rows x 4 columns]

#### ix를 이용한 라벨 색인을 통한 접근은 3차원에도 일반화되어 특정 날짜나 어떤 기간 동안의 모든 데이터를 다음처럼 선택할 수 있다

In [102]:
# 1번째 인자: Open, High, Low, Close, Volume, Adj Close
# 2번째 인자: 날짜
# 3번째 인자: 회사
pdata.ix[:, '6/1/2012', :]

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix

             Open        High         Low       Close   Adj Close       Volume
AAPL    81.308571   81.807144   80.074287   80.141426   72.099739  130246900.0
GOOGL  286.181183  286.611603  284.459473  285.775787  285.775787    6109600.0
IBM    190.119995  191.720001  188.600006  189.080002  162.828171    5206400.0
MSFT    28.760000   28.959999   28.440001   28.450001   24.668653   56634300.0

In [103]:
pdata.ix['High', '5/22/2012':, :]

                 AAPL       GOOGL         IBM       MSFT
Date
2012-05-22  81.982857  307.212219  198.259995  29.879999
2012-05-23  81.828575  305.105103  196.490005  29.400000
2012-05-24  82.357140  306.266266  196.279999  29.299999
2012-05-25  80.835716  301.166168  196.000000  29.360001
2012-05-29  82.000000  299.864868  198.080002  29.719999
2012-05-30  82.855713  296.246246  195.470001  29.480000
2012-05-31  83.071426  295.295288  194.929993  29.420000
2012-06-01  81.807144  286.611603  191.720001  28.959999

In [104]:
pdata.ix['High', '5/22/2012', :]

AAPL      81.982857
GOOGL    307.212219
IBM      198.259995
MSFT      29.879999
Name: 2012-05-22 00:00:00, dtype: float64

In [105]:
pdata.ix['Open', '5/22/2012', 'AAPL']

81.364288000000002

In [106]:
pdata.ix['High', '5/22/2012':, 'AAPL']

Date
2012-05-22    81.982857
2012-05-23    81.828575
2012-05-24    82.357140
2012-05-25    80.835716
2012-05-29    82.000000
2012-05-30    82.855713
2012-05-31    83.071426
2012-06-01    81.807144
Name: AAPL, dtype: float64

In [107]:
pdata.ix['Adj Close', '5/22/2012':, :]

                 AAPL       GOOGL         IBM       MSFT
Date
2012-05-22  71.583061  300.700714  169.493561  25.804539
2012-05-23  73.329674  305.035034  168.890732  25.240936
2012-05-24  72.656212  302.132141  168.864868  25.206251
2012-05-25  72.266800  296.061066  167.323425  25.197577
2012-05-29  73.549454  297.467468  169.183533  25.631123
2012-05-30  74.436249  294.409424  167.521484  25.440367
2012-05-31  74.251175  290.720734  166.117752  25.310303
2012-06-01  72.099739  285.775787  162.828171  24.668653

#### 통계 모델에 맞게 Panel 데이터를 출력하는 다른 방법은 DataFrame을 쌓아 놓는 것

In [108]:
# Dimensions: 6, 3, 4 라는걸 확인할 수 있다.
pdata.ix[:, '5/30/2012':, :]

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [109]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()

In [110]:
stacked

                        Open        High         Low       Close   Adj Close  \
Date       minor
2012-05-30 AAPL    81.314285   82.855713   80.937141   82.738571   74.436249
           GOOGL  294.374359  296.246246  292.057068  294.409424  294.409424
           IBM    194.800003  195.470001  193.770004  194.529999  167.521484
           MSFT    29.350000   29.480000   29.120001   29.340000   25.440367
2012-05-31 AAPL    82.962860   83.071426   81.637146   82.532860   74.251175
           GOOGL  294.654663  295.295288  289.789795  290.720734  290.720734
           IBM    194.100006  194.929993  192.000000  192.899994  166.117752
           MSFT    29.299999   29.420000   28.940001   29.190001   25.310303
2012-06-01 AAPL    81.308571   81.807144   80.074287   80.141426   72.099739
           GOOGL  286.181183  286.611603  284.459473  285.775787  285.775787
           IBM    190.119995  191.720001  188.600006  189.080002  162.828171
           MSFT    28.760000   28.959999   28.440001   28.450001   24.668653

                       Volume
Date       minor
2012-05-30 AAPL   132357400.0
           GOOGL    3809500.0
           IBM      3602500.0
           MSFT    41585500.0
2012-05-31 AAPL   122918600.0
           GOOGL    5930600.0
           IBM      9287500.0
           MSFT    39134000.0
2012-06-01 AAPL   130246900.0
           GOOGL    6109600.0
           IBM      5206400.0
           MSFT    56634300.0

In [111]:
type(stacked), type(pdata)

(pandas.core.frame.DataFrame, pandas.core.panel.Panel)

#### DataFrame에는 to_panel 메서드와 그 반대인 to_frame 메서드가 있다

In [112]:
stacked.to_panel()

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  if __name__ == '__main__':

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT

## [About my IPython in github](https://github.com/re4lfl0w/ipython)